Revit 2027 API
NurbSpline Properties
The NurbSpline type exposes the following members.
Properties
Name | Description
ApproximateLength | The approximate length of the curve.
(Inherited from Curve)
CtrlPoints | Returns the control points of the nurb spline.
Degree | Returns the degree of the nurb spline.
GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle
(Inherited from GeometryObject)
Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.
(Inherited from GeometryObject)
IsBound | Describes whether the parameter of the curve is restricted to a particular interval.
(Inherited from Curve)
IsClosed | Describes whether the curve is closed.
(Inherited from Curve)
IsCyclic | The boolean value that indicates whether this curve is cyclic.
(Inherited from Curve)
IsElementGeometry | Indicates whether this geometry is obtained directly from an Element.
(Inherited from GeometryObject)
isRational | Returns whether the nurb spline is rational or not.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Knots | Return/set the knots of the nurb spline.
Length | The exact length of the curve.
(Inherited from Curve)
Period | The period of this curve.
(Inherited from Curve)
Reference | Returns a stable reference to the curve.
(Inherited from Curve)
Visibility | The visibility.
(Inherited from GeometryObject)
Weights | Returns the weights of the nurb spline.
Top
See Also
Reference
NurbSpline Class
Autodesk.Revit.DB Namespace